---
layout: post
title: 提案：校园骇客松
slug: school-hackathon-festival
date: 2021-1-4
status: publish
author: Cody
categories: 
  - 提案
tags:
  - 骇客松
excerpt: 提案：校园骇客松
---


#提案：校园骇客松

TODO list 
举办时间 
举办场地 
参与人数合适 
校方支持 
资金支持 
活动持久化 
more… 
 
 
举办骇客松，对于 计算机技术社 我觉得是最适合不过的活动了。 
 
骇客松，是hackathon的音译，在世界范围内都很流行。一般是由主办方举办的，围绕一定主体的，以小组的形式进行为期一周的合作创造活动。很多人，在一段特定的时间内，相聚在一起，以他们想要的方式，去做他们想做的事情——整个编程的过程几乎没有任何限制或者方向。  
 
这里给出维百的词条https://zh.m.wikipedia.org/wiki/%E9%BB%91%E5%AE%A2%E6%9D%BE 
 
当然，一般来说的骇客松是有免费食物提供的，举办时间由几天到一周不等。参会人数很多。一般来说各小组的成果将在最后一天进行评选，由大家选出各种奖项。 
 
对于高中生来说，举办这样的大型活动实在是难得。当然，整个项目可以完全没有代码和实现，只需要一个ppt以及想法就行。 
 
现在有可能遇到的困难：对于高中生来说，拿出那么多天来进行活动实在是奢侈。所以举办时间以及举办天数待定，以及举办会场也是一个问题。还要考虑举办的资金问题。而且人数不一定够多。如果只有二十个人来参加活动，虽说能举办起来，但也有点少了。 
 
理想的情况是面向整个苏州市开放，将整个苏州范围内有想法的高中生汇聚一堂。与其说是比赛，更像是交友会，能以更大的概率遇到志同道合的人。对于这些人来说，这是一个与人沟通的良好的平台，更是拓宽视野的理想机会。 
 
如果能得到校方支持是最好不过的了。理想情况下，每年有固定时间举办，有资金，有场地，有足够多的人来参加，有足够多有趣的点子碰撞在一起......当然达成任何一点都是奢侈的。 
 
那么大家有什么想法呢？以及觉得举办这样的骇客松是否有必要？我个人觉得是很有意义的一件事，遂提案。
